						/* Заполнение таблиц*/
-------------------------------------------------------------------------

Use ShopDB;
GO

-- добавляем производителей
INSERT INTO Shop.Producer
VALUES
('Sony', 'Япония'),
('Panasonic', 'Япония'),
('Dell', 'США'),
('Xiaomi', 'Китай'),
('Samsung', 'Южная Корея'),
('LG', 'Южная Корея'),
('Meizu', 'Китай'),
('Lenovo', 'Китай');
GO

-- добавляем типы аксессуаров
INSERT INTO Shop.AccessoryType
VALUES
('Наушники'),
('Мышка'),
('Защитное стекло'),
('Клавиатура'),
('Блютуз гарнитура');
GO

-- добавляем аксесуары
INSERT INTO Shop.Accessory
VALUES
('Bluetooth-гарнитура K213', 'Фиолетовая', 'Bluetooth', 8, 5),
('Bluetooth-гарнитура LE12', 'Синяя', 'Bluetooth', 2, 5),
('Bluetooth-гарнитура ST1243', 'Черная', 'Bluetooth', 1, 5),
('Защитное стекло Meizu M2', 'Прозрачное', 'Клей', 7, 3),
('Защитное стекло Xiaomi Redmi Note5', 'Затемненное', 'Клей', 4, 3),
('Защитное стекло Lenove R3', 'Прозрочное', 'Клей', 8, 3),
('Мышка KL1312', 'Красная', 'AUX', 3, 2),
('Мышка LS1452', 'Черная', 'AUX', 4, 2),
('Мышка LT1422', 'Фиолетовая', 'AUX', 6, 2),
('Наушники LN142', 'Красные', 'AUX', 8, 1),
('Наушники M17', 'Синие', 'Bluetooth', 7, 1),
('Наушники D27A', 'Красные', 'AUX', 1, 1),
('Клавиатура проводная Samsung DS4100', 'Красная', 'USB', 5, 4),
('Клавиатура проводная Logitech K120', 'Черная', 'USB', 3, 4),
('Клавиатура проводная Real-El 8700 Backlit', 'Черно-синяя', 'USB', 1, 4);
GO

--добавляем склады для аксесуаров
INSERT INTO Shop.StockStore
VALUES
('Днепр', 'Мира 10'),
('Днепр', 'Чкалова 19'),
('Днепр', 'Миронова 35'),
('Киев', 'Карла Маркса 13'),
('Харьков', 'Рязанцева 33')
GO

--связываем аксесуары со складами
INSERT INTO Shop.StockStoreAccessory
VALUES
	(1, 1),	(1, 2),	(1, 3),	(1, 4),	(1, 5),	(1, 6),	(1, 7),	(1, 8),	(1, 9),	(1, 10),	(1, 11),	(1, 12),	(1, 13),	(1, 14),	(1, 15),	
	(2, 1),	(2, 2),	(2, 3),	(2, 4),	(2, 5),	(2, 6),	(2, 7),	(2, 8),	(2, 9),	(2, 10),	(2, 11),	(2, 12),	(2, 13),	(2, 14),	(2, 15),	
	(3, 1),	(3, 2),	(3, 3),	(3, 4),	(3, 5),	(3, 6),	(3, 7),	(3, 8),	(3, 9),	(3, 10),	(3, 11),	(3, 12),	(3, 13),	(3, 14),	(3, 15),
	(4, 1),	(4, 2),	(4, 3),	(4, 4),	(4, 5),	(4, 6),	(4, 7),	(4, 8),	(4, 9),	(4, 10),	(4, 11),	(4, 12),	(4, 13),	(4, 14),	(4, 15),	
	(5, 1),	(5, 2),	(5, 3),	(5, 4),	(5, 5),	(5, 6),	(5, 7),	(5, 8),	(5, 9),	(5, 10),	(5, 11),	(5, 12),	(5, 13),	(5, 14),	(5, 15);
	GO

--добавляем менеджеров на склады
INSERT INTO Shop.ManagerStockStore
VALUES
('Богдан', 'Валовый', '0990775851', 1),
('Дима', 'Жук',  '0990775852', 2),
('Иван', 'Миронов', '0990775853', 3),
('Илья', 'Валовый', '0990775858', 4);
GO


-- добавляем клиентов
INSERT INTO Shop.Client
VALUES
('Максим', 'Петров', '0932345512'),
('Ваня', 'Васильев', '0953352112'),
('Саша', 'Максимов', '0951235311'),
('Сергей', 'Васильченко', '0973218592'),
('Иван', 'Тюрок', '0973218532'),
('Бодя', 'Матенко', '0983158992'),
('Александр', 'Ивашина', '0663118592'),
('Николай', 'Валовый', '0993214592'),
('Роман', 'Иванов', '0991218592'),
('Олег', 'Ромазан', '0931518592'),
('Илья', 'Рехин', '0983258592'),
('Андрей', 'Данилов', '0961628592'),
('Евгений', 'Мирошниченко', '0983518592'),
('Руслан', 'Рихненко', '0973858592');
GO

--добавляем заказы
INSERT INTO Shop.Orders
VALUES
(1, 'Днепр','Мира','17'),
(2, 'Днепр','Сокар','18'),
(3, 'Днепр','Щорса','19'),
(4, 'Днепр','Поля','23'),
(5, 'Киев','Карла Либнехта','64'),
(6, 'Киев','Винова','13'),
(7, 'Киев','Героев Майдана','76'),
(8, 'Киев','Алуева','43'),
(9, 'Киев','Ленина','21'),
(10, 'Киев','Немирова','85'),
(11, 'Киев','Липхи','12'),
(12, 'Харьков','Резолюции','62'),
(13, 'Харьков','Мудрого','27'),
(14, 'Харьков','Великого','93');
GO

--добавляем кредитные карточки
INSERT INTO Shop.CreditCard
VALUES
(1234634123551234,'Сергей', 'Васильченко', '2019-01-01', 5, NULL),
(1234684121551237, 'Иван', 'Тюрок', '2020-01-01', 6, NULL);

-- добавляем товары
INSERT INTO Shop.Goods
VALUES
(1, 3, 3),
(2, 4, 1),
(3, 7, 2),
(4, 12, 4),
(5, 11, 2),
(6, 2, 6),
(7, 6, 3),
(8, 3, 2),
(9, 9, 1),
(10, 7, 7),
(11, 12, 4),
(12, 14, 3),
(13, 4, 6),
(14, 6, 1);
GO